diagrams up
